---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.GetUIDataItems
source: html/7f0b4b22-4434-9973-22ea-b89478f2ff33.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.GetUIDataItems Method

Gets all UI data items stored in the UI data.

## Syntax (C#)
```csharp
public IList<DuctFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
```

## Returns
An array of UI data items.